var level = (function () {
    var repository = {
        'debug': {
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🍎🍐🍋🥥🅾️',
                '🅾️🍐🍐🍋🥥🫐🍠🍎🍐🍋🥥🅾️',
                '🅾️🍋🍋🍋🥥🫐🍠🍎🍐🍋🥥🅾️',
                '🅾️🥥🥥🥥🥥🫐🍠🍎🍐🍋🥥🅾️',
                '🅾️🫐🫐🫐🫐🫐🍠🍎🍐🍋🥥🅾️',
                '🅾️🍠🍠🍠🍠🍠🍠🍎🍐🍋🥥🅾️',
                '🅾️🍎🍎🍎🍎🍎🍎🍎🍐🍋🥥🅾️',
                '🅾️🍐🍐🍐🍐🍐🍐🍐🍐🍋🥥🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ]
        },
        'tests': [
            {
                'title': 'Column solving',
                'design': [
                    '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                    '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                    '🅾️⚪️⚪️🍋🥥🫐🍠🅾️',
                    '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                    '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                    '🅾️⚪️🍐🍋🥥🫐🍠🅾️',
                    '🅾️⚪️⚪️⚪️🥥🫐🍠🅾️',
                    '🅾️⚪️⚪️⚪️⚪️⚪️🍠🅾️',
                    '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
                ],
                'expectedResult': [
                    '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                    '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                    '🅾️⚪️⚪️⬜️⬜️⬜️🍠🅾️',
                    '🅾️🍎⬜️🐯⬜️⬜️⬜️🅾️',
                    '🅾️🍎⬜️⬜️🏵️🏵️⬜️🅾️',
                    '🅾️⚪️⬜️⬜️⬜️⬜️🏵️🅾️',
                    '🅾️⚪️⚪️⚪️⬜️⬜️⬜️🅾️',
                    '🅾️⚪️⚪️⚪️⚪️⚪️⬜️🅾️',
                    '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
                ],
                'expectedAnimation': [
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                    '⬜️⬜️⬜️🔽⏬️⏬️⬜️⬜️',
                    '⬜️⬜️🗑️🔄🔽🔽⏬️⬜️',
                    '⬜️⬜️🗑️🔼🔄🔄🔽⬜️',
                    '⬜️⬜️🗑️⏫️🔼🔼🔄⬜️',
                    '⬜️⬜️⬜️⬜️⏫️⏫️🔼⬜️',
                    '⬜️⬜️⬜️⬜️⬜️⬜️⏫️⬜️',
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                ],
            },
            {
                'title': 'Row solving',
                'design': [
                    '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                    '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                    '🅾️⚪️⚪️🍐🍐🍐⚪️⚪️🅾️',
                    '🅾️⚪️🍋🍋🍋🍋⚪️⚪️🅾️',
                    '🅾️⚪️🥥🥥🥥🥥🥥⚪️🅾️',
                    '🅾️🫐🫐🫐🫐🫐🫐⚪️🅾️',
                    '🅾️🍠🍠🍠🍠🍠🍠🍠🅾️',
                    '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
                ],
                'expectedResult': [
                    '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                    '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                    '🅾️⚪️⚪️⬜️⬜️⬜️⚪️⚪️🅾️',
                    '🅾️⚪️⬜️🐅⬜️⬜️⚪️⚪️🅾️',
                    '🅾️⚪️⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                    '🅾️🫐⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                    '🅾️🍠🍠⬜️⬜️🏵️⬜️⬜️🅾️',
                    '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
                ],
                'expectedAnimation': [
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                    '⬜️⬜️⬜️🗑️🗑️🗑️⬜️⬜️⬜️',
                    '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️⬜️',
                    '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                    '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                    '⬜️⬜️⬜️⏩️▶️🔄◀️⏪️⬜️',
                    '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                ],
            },
        ],
    };

    function init() {
    }

    function funcGetDebug() {
        return repository.debug;
    }

    function funcGetTests() {
        return repository.tests;
    }

    init();

    return {
        getDebug: funcGetDebug,
        getTests: funcGetTests,
    };
}());