var test = (function () {
    var testLevels = [
        {
            'title': '3 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '4 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️🐷🐮🐯🐦🐭🐵⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔽🔽🔽🔽🔽🔽⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔄🔄🔄🔄🔄🔄⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔼🔼🔼🔼🔼🔼⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏫️⏫️⏫️⏫️⏫️⏫️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '5 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🏵️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏬️⏬️⏬️⏬️⏬️⏬️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔽🔽🔽🔽🔽🔽⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔄🔄🔄🔄🔄🔄⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔼🔼🔼🔼🔼🔼⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏫️⏫️⏫️⏫️⏫️⏫️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '3 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': '4 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🍠🅾️',
                '🅾️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️🐖⬜️⬜️🅾️',
                '🅾️⬜️🐄⬜️⬜️🅾️',
                '🅾️⬜️🐅⬜️⬜️🅾️',
                '🅾️⬜️🦢⬜️⬜️🅾️',
                '🅾️⬜️🐁⬜️⬜️🅾️',
                '🅾️⬜️🐒⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': '5 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🍠🍠🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': 'Column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                '🅾️⚪️⚪️🍋🥥🫐🍠🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                '🅾️⚪️🍐🍋🥥🫐🍠🅾️',
                '🅾️⚪️⚪️⚪️🥥🫐🍠🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                '🅾️⚪️⚪️⬜️⬜️⬜️🍠🅾️',
                '🅾️🍎⬜️🐯⬜️⬜️⬜️🅾️',
                '🅾️🍎⬜️⬜️🏵️🏵️⬜️🅾️',
                '🅾️⚪️⬜️⬜️⬜️⬜️🏵️🅾️',
                '🅾️⚪️⚪️⚪️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⏬️⏬️⬜️⬜️',
                '⬜️⬜️🗑️🔄🔽🔽⏬️⬜️',
                '⬜️⬜️🗑️🔼🔄🔄🔽⬜️',
                '⬜️⬜️🗑️⏫️🔼🔼🔄⬜️',
                '⬜️⬜️⬜️⬜️⏫️⏫️🔼⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⏫️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                '🅾️⚪️⚪️🍐🍐🍐⚪️⚪️🅾️',
                '🅾️⚪️🍋🍋🍋🍋⚪️⚪️🅾️',
                '🅾️⚪️🥥🥥🥥🥥🥥⚪️🅾️',
                '🅾️🫐🫐🫐🫐🫐🫐⚪️🅾️',
                '🅾️🍠🍠🍠🍠🍠🍠🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                '🅾️⚪️⚪️⬜️⬜️⬜️⚪️⚪️🅾️',
                '🅾️⚪️⬜️🐅⬜️⬜️⚪️⚪️🅾️',
                '🅾️⚪️⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                '🅾️🫐⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                '🅾️🍠🍠⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️🗑️🗑️⬜️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn complete board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn smaller board',
            'method': 'board.spawn',
            'design': [
                '🅾️🅾️⬇️⬇️⬇️⬇️⬇️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️🅾️⬇️⬇️⬇️⬇️⬇️🅾️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn split board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn hole board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🅾️🅾️🅾️⬜️⬜️🅾️',
                '🅾️⬜️🅾️🅾️⬜️🅾️🅾️⬜️🅾️',
                '🅾️⬜️⬜️⬇️⬇️⬇️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️🅾️🅾️🅾️✴️✴️🅾️',
                '🅾️✴️🅾️🅾️⬜️🅾️🅾️✴️🅾️',
                '🅾️✴️⬜️⬇️⬇️⬇️⬜️✴️🅾️',
                '🅾️✴️⬜️✴️✴️✴️⬜️✴️🅾️',
                '🅾️✴️⬜️✴️✴️✴️⬜️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe to left',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🫐🍋🍠🅾️',
                '🅾️🍠🍎🍋🫐🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍋🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe to right',
            'method': 'swipe.right',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🫐🍋🍠🅾️',
                '🅾️🍠🫐🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍋⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe to top',
            'method': 'swipe.top',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🍋🫐🫐🍋🍠🅾️',
                '🅾️🍠🍎🍋🫐🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🍋⬜️⬜️⬜️🍠🅾️',
                '🅾️🍠🍎🍋🍋🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️🗑️🗑️🗑️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe to bottom',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🫐🍋🅾️',
                '🅾️🍋🫐🫐🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍋🍋🅾️',
                '🅾️🍋⬜️⬜️⬜️🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️🗑️🗑️🗑️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to left (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🫐🍋🅾️',
                '🅾️🍋🍠🫐🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🐭🍠🍋🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏫️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to right (#1)',
            'method': 'swipe.right',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🫐🍠🍎🍋🅾️',
                '🅾️🍋🍠🫐🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍠🐭🍎🍋🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏫️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to top (#1)',
            'method': 'swipe.top',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍠🫐🍋🫐🫐🍋🅾️',
                '🅾️🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍠⬜️🐁⬜️⬜️🍋🅾️',
                '🅾️🍎🍋🍋🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to bottom (#1)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🫐🍋🍠🍎🅾️',
                '🅾️🍠🫐🍋🫐🫐🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍋🍋🍠🍎🅾️',
                '🅾️🍠⬜️🐁⬜️⬜️🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to left (#2)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🫐🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠🐭🍎🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏬️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to right (#2)',
            'method': 'swipe.right',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🫐🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍎🐭🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏬️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to top (#2)',
            'method': 'swipe.top',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍠🫐🫐🍠🫐🍋🅾️',
                '🅾️🍎🍋🍠🫐🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍠⬜️⬜️🐁⬜️🍋🅾️',
                '🅾️🍎🍋🍠🍠🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 4 items to bottom (#2)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🅾️',
                '🅾️🍠🫐🫐🍠🫐🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍠🍠🍎🅾️',
                '🅾️🍠⬜️⬜️🐁⬜️🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 5 items to left',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🫐🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🏵️🍎🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏬️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔄⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏫️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 5 items to right',
            'method': 'swipe.right',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🫐🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍎🏵️🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏬️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔄⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏫️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 5 items to top',
            'method': 'swipe.top',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🫐🫐🍎🫐🫐🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎⬜️⬜️🏵️⬜️⬜️🍎🅾️',
                '🅾️🍋🍠🍎🍎🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe 5 items to bottom',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🫐🫐🍎🫐🫐🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍎🍎🍋🍠🅾️',
                '🅾️🍎⬜️⬜️🏵️⬜️⬜️🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 3 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🐭🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 3 items (#2)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🐭🍎🍋🅾️',
                '🅾️🍋🫐🍎🫐🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍎🍎🍋🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 3 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🐁🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠⬜️🍎🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 3 items (#2)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🐁🍎🍋🅾️',
                '🅾️🍋🫐🍎🫐🍠🅾️',
                '🅾️🍠🍎🍋🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋⬜️⬜️⬜️🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️🗑️🗑️🗑️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 4 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🐭🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🫐🍠🅾️',
                '🅾️🍠🍎🐭🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠🐭🍎🍠🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️⏬️🗑️🗑️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️🗑️🗑️🔼🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 4 items (#2)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🐭🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️⬜️⬜️🐭⬜️⬜️🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏬️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️🗑️🗑️🔄🗑️🗑️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 4 items (#3)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍋🐭🍎🫐🐭🍎🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍎🍎🍋🍠🅾️',
                '🅾️⬜️⬜️🐁⬜️⬜️⬜️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️▶️🔄◀️⏪️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 4 items (#4)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🐭🍎🍋🍠🅾️',
                '🅾️🍋🫐🍎🫐🫐🍎🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍎🍎🍋🍠🅾️',
                '🅾️⬜️⬜️🐁⬜️⬜️⬜️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️▶️🔄◀️⏪️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 4 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🐁🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🫐🍠🅾️',
                '🅾️🍠🍎🐁🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠🐭🍎🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏬️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 4 items (#2)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠🍎🍋🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🫐🍎🍋🅾️',
                '🅾️🍋🍠🍎🐁🍠🅾️',
                '🅾️🍠🍎🫐🍠🍎🅾️',
                '🅾️🍎🍋🍠🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍋🍠⬜️🍋🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🍋🍠🐭🍎🍠🅾️',
                '🅾️🍠🍎⬜️🍠🍎🅾️',
                '🅾️🍎🍋⬜️🍎🍋🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⏬️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔄⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔼⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 4 items (#3)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍋🐁🍎🫐🐁🍎🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠⬜️🍋🍠⬜️🍋🅾️',
                '🅾️🍎⬜️🍎🍎⬜️🍠🅾️',
                '🅾️🍋⬜️🐁⬜️⬜️🍎🅾️',
                '🅾️🍠⬜️🍋🍠⬜️🍋🅾️',
                '🅾️🍎⬜️🍠🍎⬜️🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 4 items (#4)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🐁🍎🍋🍠🅾️',
                '🅾️🍋🫐🍎🫐🫐🍎🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍋⬜️🐁⬜️⬜️🍎🅾️',
                '🅾️🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 5 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🐭🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🫐🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🐭🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🏵️🍎🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️⏬️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔄⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️⏫️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 5 items (#2)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🐭🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️⬜️⬜️⬜️🏵️⬜️⬜️⬜️🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏬️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🔄🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏫️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 5 items (#3)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🐭🫐🍎🫐🐭🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍎🍎🍋🍠🅾️',
                '🅾️⬜️⬜️⬜️🏵️⬜️⬜️⬜️🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️⏩️▶️🔄◀️⏪️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve h striped 5 items (#4)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🐭🍎🍋🍠🅾️',
                '🅾️🍎🫐🫐🍎🫐🫐🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍎🍎🍋🍠🅾️',
                '🅾️⬜️⬜️⬜️🏵️⬜️⬜️⬜️🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️⏩️▶️🔄◀️⏪️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 5 items (#1)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🐁🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🫐🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🐁🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🏵️🍎🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏬️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔄⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏫️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 5 items (#2)',
            'method': 'swipe.left',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🐁🍠🍎🅾️',
                '🅾️🍋🍠🍎🫐🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🏵️🍎🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏬️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔽⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔄⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🔼⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⏫️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 5 items (#3)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🐁🫐🍎🫐🐁🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎⬜️🍠🍎🍋⬜️🍎🅾️',
                '🅾️🍋⬜️🍎🍋🍠⬜️🍋🅾️',
                '🅾️🍠⬜️🍋🍎🍎⬜️🍠🅾️',
                '🅾️🍎⬜️⬜️🏵️⬜️⬜️🍎🅾️',
                '🅾️🍋⬜️🍎🍋🍠⬜️🍋🅾️',
                '🅾️🍠⬜️🍋🍠🍎⬜️🍠🅾️',
                '🅾️🍎⬜️🍠🍎🍋⬜️🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️🗑️⬜️⬜️⬜️🗑️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Solve v striped 5 items (#4)',
            'method': 'swipe.bottom',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🐁🍎🍋🍠🅾️',
                '🅾️🍎🫐🫐🍎🫐🫐🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎⬜️⬜️🏵️⬜️⬜️🍎🅾️',
                '🅾️🍋🍠🍎⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
    ];

    function init() {
    }

    function swipeTest(repository, toTop, toLeft, toRight, toBottom) {
        var savedRepository = board.copyRepository1to1(repository);
        var returnRepository = board.copyRepository1to1(repository);
        var rows = board.getRows(repository);
        var cols = board.getCols(repository);
        var countSuccess = 0;
        var startX = 0;
        var startY = 0;

        if (toLeft || toRight) {
            ++startX;
        }
        if (toTop || toBottom) {
            ++startY;
        }
        for (var y = startY; y < rows; ++y) {
            for (var x = startX; x < cols; ++x) {
                repository = board.copyRepository1to1(savedRepository);
                var newX = x, newY = y, oldX = x, oldY = y;

                if (toTop) {
                    newY -= 1;
                } else if (toLeft) {
                    newX -= 1;
                } else if (toRight) {
                    oldX -= 1;
                } else if (toBottom) {
                    oldY -= 1;
                }

                board.swapPosition(repository, oldX, oldY, newX, newY);
                repository = solve.move(repository, newX, newY, oldX, oldY);

                var changed = !board.equalBoards(savedRepository.animate_, repository.animate_);
                if (changed) {
                    ++countSuccess;

                    board.swapInitialPosition(repository, oldX, oldY, newX, newY);
                    returnRepository = board.copyRepository1to1(repository);
                }
            }
        }

        if (countSuccess !== 1) {
            console.error(countSuccess + ' possible level solvings.');
            returnRepository = board.copyRepository1to1(savedRepository);
        }

        return returnRepository;
    }

    function funcRun() {
        testLevels.forEach(testLevel => {
            var method = testLevel.method;
            var repository = board.copyRepositoryFromDesign(testLevel.design);

            for (var i = 0; i < 10; ++i) {
                switch (method) {
                    case 'solve.board':
                        repository = solve.board(repository);
                        break;
                    case 'board.spawn':
                        repository = board.spawn(repository);
                        break;
                    case 'swipe.top':
                        repository = swipeTest(repository, true, false, false, false);
                        break;
                    case 'swipe.left':
                        repository = swipeTest(repository, false, true, false, false);
                        break;
                    case 'swipe.right':
                        repository = swipeTest(repository, false, false, true, false);
                        break;
                    case 'swipe.bottom':
                        repository = swipeTest(repository, false, false, false, true);
                        break;
                    default:
                        console.error('No method defined');
                }

                var success =
                    (successInitial = board.equalBoardsWithLogging(repository.initial_, testLevel.design)) &&
                    (successCleaned = board.equalBoardsWithLogging(repository.cleaned_, testLevel.expectedResult)) &&
                    (successAnimate = board.equalBoardsWithLogging(repository.animate_, testLevel.expectedAnimation));

                if (!success) {
                    if (!successInitial) {
                        console.error('Test "' + testLevel.title + '" failed @ initial.');
                        console.table(repository.initial_.map(function(line) { return line.join(''); }));
                        console.table(testLevel.design);
                    }
                    if (!successCleaned) {
                        console.error('Test "' + testLevel.title + '" failed @ cleaned.');
                        console.table(repository.cleaned_.map(function(line) { return line.join(''); }));
                        console.table(testLevel.expectedResult);
                    }
                    if (!successAnimate) {
                        console.error('Test "' + testLevel.title + '" failed @ animate.');
                        console.table(repository.animate_.map(function(line) { return line.join(''); }));
                        console.table(testLevel.expectedAnimation);
                    }
                }

                if ('board.spawn' !== method) {
                    break;
                }
            }
        });
    }

    init();

    return {
        run: funcRun,
    };
}());