var test = (function () {
    var testLevels = [
        {
            'title': '3 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️🗑️🗑️🗑️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '4 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🐷🐮🐯🐦🐭🐵🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔽🔽🔽🔽🔽🔽⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔄🔄🔄🔄🔄🔄⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔼🔼🔼🔼🔼🔼⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏫️⏫️⏫️⏫️⏫️⏫️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '5 in a column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🏵️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️🐷🐖🐮🐄🐯🐅🐦🦢🐭🐁🐵🐒⬜️⚪️🏵️🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏬️⏬️⏬️⏬️⏬️⏬️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔽🔽🔽🔽🔽🔽⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔄🔄🔄🔄🔄🔄⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️🔼🔼🔼🔼🔼🔼⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏫️⏫️⏫️⏫️⏫️⏫️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': '3 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🅾️',
                '🅾️🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️🗑️🗑️🗑️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': '4 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🍠🅾️',
                '🅾️🐷🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️🐖⬜️⬜️🅾️',
                '🅾️⬜️🐄⬜️⬜️🅾️',
                '🅾️⬜️🐅⬜️⬜️🅾️',
                '🅾️⬜️🦢⬜️⬜️🅾️',
                '🅾️⬜️🐁⬜️⬜️🅾️',
                '🅾️⬜️🐒⬜️⬜️🅾️',
                '🅾️🐷🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': '5 in a row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍎🍎🍎🍎🅾️',
                '🅾️🍐🍐🍐🍐🍐🅾️',
                '🅾️🍋🍋🍋🍋🍋🅾️',
                '🅾️🥥🥥🥥🥥🥥🅾️',
                '🅾️🫐🫐🫐🫐🫐🅾️',
                '🅾️🍠🍠🍠🍠🍠🅾️',
                '🅾️🐷🐷🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️🐷🐷🐷🐷🐷🅾️',
                '🅾️🐖🐖🐖🐖🐖🅾️',
                '🅾️🐮🐮🐮🐮🐮🅾️',
                '🅾️🐄🐄🐄🐄🐄🅾️',
                '🅾️🐯🐯🐯🐯🐯🅾️',
                '🅾️🐅🐅🐅🐅🐅🅾️',
                '🅾️🐦🐦🐦🐦🐦🅾️',
                '🅾️🦢🦢🦢🦢🦢🅾️',
                '🅾️🐭🐭🐭🐭🐭🅾️',
                '🅾️🐁🐁🐁🐁🐁🅾️',
                '🅾️🐵🐵🐵🐵🐵🅾️',
                '🅾️🐒🐒🐒🐒🐒🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🅾️',
                '🅾️🏵️🏵️🏵️🏵️🏵️🅾️',
                '🅾️🐞🐞🐞🐞🐞🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️'
            ],
        },
        {
            'title': 'Column solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                '🅾️⚪️⚪️🍋🥥🫐🍠🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                '🅾️🍎🍐🍋🥥🫐🍠🅾️',
                '🅾️⚪️🍐🍋🥥🫐🍠🅾️',
                '🅾️⚪️⚪️⚪️🥥🫐🍠🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️⚪️⚪️🫐🍠🅾️',
                '🅾️⚪️⚪️⬜️⬜️⬜️🍠🅾️',
                '🅾️🍎⬜️🐯⬜️⬜️⬜️🅾️',
                '🅾️🍎⬜️⬜️🏵️🏵️⬜️🅾️',
                '🅾️⚪️⬜️⬜️⬜️⬜️🏵️🅾️',
                '🅾️⚪️⚪️⚪️⬜️⬜️⬜️🅾️',
                '🅾️⚪️⚪️⚪️⚪️⚪️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🔽⏬️⏬️⬜️⬜️',
                '⬜️⬜️🗑️🔄🔽🔽⏬️⬜️',
                '⬜️⬜️🗑️🔼🔄🔄🔽⬜️',
                '⬜️⬜️🗑️⏫️🔼🔼🔄⬜️',
                '⬜️⬜️⬜️⬜️⏫️⏫️🔼⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⏫️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Row solving',
            'method': 'solve.board',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                '🅾️⚪️⚪️🍐🍐🍐⚪️⚪️🅾️',
                '🅾️⚪️🍋🍋🍋🍋⚪️⚪️🅾️',
                '🅾️⚪️🥥🥥🥥🥥🥥⚪️🅾️',
                '🅾️🫐🫐🫐🫐🫐🫐⚪️🅾️',
                '🅾️🍠🍠🍠🍠🍠🍠🍠🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⚪️⚪️🍎🍎⚪️⚪️⚪️🅾️',
                '🅾️⚪️⚪️⬜️⬜️⬜️⚪️⚪️🅾️',
                '🅾️⚪️⬜️🐅⬜️⬜️⚪️⚪️🅾️',
                '🅾️⚪️⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                '🅾️🫐⬜️⬜️🏵️⬜️⬜️⚪️🅾️',
                '🅾️🍠🍠⬜️⬜️🏵️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️🗑️🗑️🗑️⬜️⬜️⬜️',
                '⬜️⬜️▶️🔄◀️⏪️⬜️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⏩️▶️🔄◀️⏪️⬜️⬜️',
                '⬜️⬜️⬜️⏩️▶️🔄◀️⏪️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn complete board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn smaller board',
            'method': 'board.spawn',
            'design': [
                '🅾️🅾️⬇️⬇️⬇️⬇️⬇️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️🅾️⬇️⬇️⬇️⬇️⬇️🅾️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️⬜️✴️✴️✴️✴️✴️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn split board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Spawn hole board',
            'method': 'board.spawn',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️🅾️🅾️🅾️⬜️⬜️🅾️',
                '🅾️⬜️🅾️🅾️⬜️🅾️🅾️⬜️🅾️',
                '🅾️⬜️⬜️⬇️⬇️⬇️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️⬜️⬜️⬜️⬜️⬜️⬜️⬜️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️✴️✴️✴️✴️✴️🅾️',
                '🅾️✴️✴️🅾️🅾️🅾️✴️✴️🅾️',
                '🅾️✴️🅾️🅾️⬜️🅾️🅾️✴️🅾️',
                '🅾️✴️⬜️⬇️⬇️⬇️⬜️✴️🅾️',
                '🅾️✴️⬜️✴️✴️✴️⬜️✴️🅾️',
                '🅾️✴️⬜️✴️✴️✴️⬜️✴️🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        },
        {
            'title': 'Swipe to right',
            'method': 'swipe.right',
            'design': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🫐🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🫐🍋🍠🍎🅾️',
                '🅾️🍋🍠🫐🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedResult': [
                '🅾️⬇️⬇️⬇️⬇️⬇️⬇️⬇️🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🍋🍠🍎🍋🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋⬜️🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠⬜️🍋🍠🍎🅾️',
                '🅾️🍋🍠🍋⬜️🍠🍎🍋🅾️',
                '🅾️🍠🍎🍋🍠🍎🍋🍠🅾️',
                '🅾️🍎🍋🍠🍎🍋🍠🍎🅾️',
                '🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️🅾️'
            ],
            'expectedAnimation': [
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️🗑️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
                '⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️⬜️',
            ],
        }
    ];

    function init() {
    }

    function swipeRight(repository) {
        var savedRepository = board.copyRepository1to1(repository);
        var returnRepository = board.copyRepository1to1(repository);
        var rows = board.getRows(repository);
        var cols = board.getCols(repository);
        var countSuccess = 0;

        for (var y = 0; y < rows; ++y) {
            for (var x = 1; x < cols; ++x) {
                repository = board.copyRepository1to1(savedRepository);
                board.swapPosition(repository, x - 1, y, x, y);
                repository = solve.board(repository);

                var changed = !board.equalBoards(savedRepository.animate, repository.animate);
                if (changed) {
                    ++countSuccess;

                    board.swapInitialPosition(repository, x - 1, y, x, y);
                    returnRepository = board.copyRepository1to1(repository);
                }
            }
        }

        if (countSuccess !== 1) {
            console.error(countSuccess + ' possible level solvings.');
            returnRepository = board.copyRepository1to1(savedRepository);
        }

        return returnRepository;
    }

    function funcRun() {
        testLevels.forEach(testLevel => {
            var method = testLevel.method;
            var repository = board.copyRepositoryFromDesign(testLevel.design);

            for (var i = 0; i < 10; ++i) {
                switch (method) {
                    case 'solve.board':
                        repository = solve.board(repository);
                        break;
                    case 'board.spawn':
                        repository = board.spawn(repository);
                        break;
                    case 'swipe.right':
                        repository = swipeRight(repository);
                        break;
                    default:
                        console.error('No method defined');
                }

                var success =
                    (successInitial = board.equalBoardsWithLogging(repository.initial, testLevel.design)) &&
                    (successCleaned = board.equalBoardsWithLogging(repository.cleaned, testLevel.expectedResult)) &&
                    (successAnimate = board.equalBoardsWithLogging(repository.animate, testLevel.expectedAnimation));

                if (!success) {
                    if (!successInitial) {
                        console.error('Test "' + testLevel.title + '" failed @ initial.');
                        console.table(repository.initial);
                        console.table(testLevel.design);
                    }
                    if (!successCleaned) {
                        console.error('Test "' + testLevel.title + '" failed @ cleaned.');
                        console.table(repository.cleaned);
                        console.table(testLevel.expectedResult);
                    }
                    if (!successAnimate) {
                        console.error('Test "' + testLevel.title + '" failed @ animate.');
                        console.table(repository.animate);
                        console.table(testLevel.expectedAnimation);
                    }
                }

                if ('board.spawn' !== method) {
                    break;
                }
            }
        });
    }

    init();

    return {
        run: funcRun,
    };
}());